rtzaudio/STC1200_TivaTM4C1294NCPDT/httpServer.c
/***************************************************************************
 *
 * STC-1200 Digital Search Timer Cue Controller for Ampex MM-1200.
 *
 * Copyright (C) 2016-2019, RTZ Professional Audio, LLC
 * All Rights Reserved
 *
 * RTZ is registered trademark of RTZ Professional Audio, LLC
 *
 ***************************************************************************
 *
 * Copyright (c) 2014, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ***************************************************************************/

/* XDCtools Header files */
#include <xdc/std.h>
#include <xdc/cfg/global.h>
#include <xdc/runtime/System.h>
#include <xdc/runtime/Error.h>
#include <xdc/runtime/Gate.h>
#include <xdc/runtime/Memory.h>

/* BIOS Header files */
#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Semaphore.h>
#include <ti/sysbios/knl/Event.h>
#include <ti/sysbios/knl/Mailbox.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Queue.h>
#include <ti/sysbios/gates/GateMutex.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>

/* TI-RTOS Driver files */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/SDSPI.h>
#include <ti/drivers/I2C.h>
#include <ti/drivers/UART.h>

/* TI-RTOS NDK files */
#include <ti/ndk/inc/netmain.h>
#include <ti/ndk/inc/stkmain.h>
#include <ti/ndk/inc/tools/cgiparse.h>
#include <ti/ndk/inc/tools/cgiparsem.h>
#include <ti/ndk/inc/tools/console.h>

#include <file.h>
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdbool.h>

/* STC1200 Board Header file */
#include "STC1200.h"
#include "SMPTE.h"
#include "Board.h"
#include "Utils.h"
#include "RemoteTask.h"
#include "RAMPMessage.h"
#include "IPCServer.h"
#include "IPCCommands.h"

static bool rec_arm = false;
static bool rec_active = false;

static const char strCopyright[] = "Copyright &copy; 2021-2024, RTZ Professional Audio\r\n";

/* Static CGI callback functions */
static Int sendIndexHtml(SOCKET htmlSock, int length);
static Int sendConfigHtml(SOCKET htmlSock, int length);
static int cgiConfig(SOCKET htmlSock, int ContentLength, char *pArgs);
static Int sendRemoteHtml(SOCKET htmlSock, int length);
static int cgiRemote(SOCKET htmlSock, int ContentLength, char *pArgs);

static void emitHeader(SOCKET htmlSock, int menu_active, char* page_title);
static void emitFooter(SOCKET htmlSock);
static char *getstrYesNo(int f);
static char *getstrFPS(void);
static char *getstrSMPTEMode(void);

#define html(str) httpSendClientStr(htmlSock, (char *)str)

//*****************************************************************************
// Main Entry Point
//*****************************************************************************

Void AddWebFiles(Void)
{
    efs_createfile("index.html", 0, (UINT8 *)&sendIndexHtml);
    efs_createfile("config.html", 0, (UINT8 *)&sendConfigHtml);
    efs_createfile("config.cgi", 0, (UINT8 *)&cgiConfig);
    efs_createfile("remote.html", 0, (UINT8 *)&sendRemoteHtml);
    efs_createfile("remote.cgi", 0, (UINT8 *)&cgiRemote);
}

Void RemoveWebFiles(Void)
{
    efs_destroyfile("remote.cgi");
    efs_destroyfile("remote.html");
    efs_destroyfile("config.cgi");
    efs_destroyfile("config.html");
    efs_destroyfile("index.html");
}

//*****************************************************************************
//
//*****************************************************************************

char* getstrFPS(void)
{
    char *p;

    switch(g_sys.cfgSTC.smpteFPS)
    {
    case SMPTE_CTL_FPS24:
        p = "24";
        break;
    case SMPTE_CTL_FPS25:
        p = "25";
        break;
    case SMPTE_CTL_FPS30:
        p = "30";
        break;
    case SMPTE_CTL_FPS30D:
        p = "30D";
        break;
    default:
        p = "0";
        break;
    }

    return p;
}

char* getstrSMPTEMode(void)
{
    char *p;

    switch(g_sys.smpteMode)
    {
    case STC_SMPTE_OFF:         /* smpte module off           */
        p = "Ready";
        break;
    case STC_SMPTE_ENCODER:     /* master stripe mode active  */
        p = "Master";
        break;
    case STC_SMPTE_SLAVE:       /* slave mode decode active   */
        p = "Slave";
        break;
    default:
        p = "N/A";
        break;
    }

    return p;
}

char* getstrYesNo(int f)
{
    return f ? "\"yes\"" : "\"no\"";
}

//*****************************************************************************
//
//*****************************************************************************

