rtzaudio/STC1200_TivaTM4C1294NCPDT/httpServer.c
void emitHeader(SOCKET htmlSock, int menu_active, char* page_title)
{
    char buf[128];

    html("<!DOCTYPE html>\r\n");
    html("<html>\r\n");
    System_sprintf(buf, "<title>STC-1200 | %s</title>\r\n", page_title);
    html(buf);
    html("<meta charset=\"utf-8\">\r\n");
    html("<head>\r\n");
    html("<meta name=\"viewport\" content=\"width=device-width, initial-scale=1\">\r\n");
    html("<link rel=\"stylesheet\" type=\"text/css\" href=\"css/style.css\">\r\n");
    html("</head>\r\n");
    html("<body>\r\n");
    html("<div class=\"container wrapper\">\r\n");
    html("<div id=\"top\">\r\n");
    html("<h1>STC-1200</h1>\r\n");
    html("<p>admin server</p>\r\n");
    html("</div>\r\n");

    if (menu_active >= 0)
    {
        html("<div class=\"wrapper\">\r\n");
        html("<div id=\"menubar\">\r\n");
        html("<ul id=\"menulist\">\r\n");
        if (menu_active >= 0)
        System_sprintf(buf, "<li class=\"menuitem %s\" onclick=\"window.location.href='index.html'\">Home\r\n",
             (menu_active == 0) ? "active" : "");
        html(buf);
        System_sprintf(buf, "<li class=\"menuitem %s\" onclick=\"window.location.href='config.html'\">Configure\r\n",
             (menu_active == 1) ? "active" : "");
        html(buf);
        System_sprintf(buf, "<li class=\"menuitem %s\" onclick=\"window.location.href='remote.html'\">Remote\r\n",
             (menu_active == 2) ? "active" : "");
        html(buf);
        html("</ul>\r\n");
        html("</div>\r\n");
    }
}

void emitFooter(SOCKET htmlSock)
{
    html("</div>\r\n");
    html("</div>\r\n");
    html("<div id=\"bottom\">\r\n");
    html(strCopyright);
    html("</div>\r\n");
    html("</div>\r\n");
    html("</body>\r\n");
    html("</html>\r\n");
}

//*****************************************************************************
// CGI Index Page Callback Function
//*****************************************************************************

static Int sendIndexHtml(SOCKET htmlSock, int length)
{
    Char buf[MAX_RESPONSE_SIZE];
    Char serialnum[64];
    Char mac[32];
    Char timestr[16];
    Char datestr[16];

    /* Format the 128-bit serial number as a string */
    GetSerialNumStr(serialnum, g_sys.ui8SerialNumberSTC);
    /* Format the MAC address as a string */
    GetMACAddrStr(mac, g_sys.ui8MAC);
    /* get current date & time */
    RTC_GetTimeStr(&g_sys.timeDate, timestr);
    RTC_GetDateStr(&g_sys.timeDate, datestr);

    /* Send header portion of the html */
    emitHeader(htmlSock, 0, "home");

    html("<div id=\"main\">\r\n");
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">System Summary</legend>\r\n");

    System_sprintf(buf, "<p>STC Firmware: v%d.%02d.%03d</p>\r\n",
                   FIRMWARE_VER, FIRMWARE_REV, FIRMWARE_BUILD);
    html(buf);

    System_sprintf(buf, "<p>DTC Firmware: v%d.%02d.%03d</p>\r\n",
                   g_sys.dtcVersion >> 16, g_sys.dtcVersion & 0xFFFF, g_sys.dtcBuild);
    html(buf);

    System_sprintf(buf, "<p>PCB serial#: %s</p>\r\n", serialnum);
    html(buf);
    System_sprintf(buf, "<p>MAC address: %s</p>\r\n", mac);
    html(buf);
    System_sprintf(buf, "<p>IP address: %s</p>\r\n", g_sys.ipAddr);
    html(buf);
    System_sprintf(buf, "<p>Tape speed: %d IPS</p>\r\n", g_sys.tapeSpeed);
    html(buf);
    System_sprintf(buf, "<p>Roller encoder errors: %d</p>\r\n", g_sys.qei_error_cnt);
    html(buf);
    html("<p>DCS track controller: ");
    if (g_sys.dcsFound)
        System_sprintf(buf, "%d tracks</p>\r\n", g_sys.trackCount);
    else
        System_sprintf(buf, "N/A</p>\r\n");
    html(buf);
    html("<p>SMPTE time code card: ");
    if (g_sys.smpteFound)
    {
        System_sprintf(buf, "%s %s fps</p>\r\n", getstrSMPTEMode(), getstrFPS());
        html(buf);
    }
    else
    {
        html("N/A</p>\r\n");
    }
    System_sprintf(buf, "<p>MIDI device ID: %d</p>\r\n", g_sys.cfgSTC.midiDevID);
    html(buf);
    System_sprintf(buf, "<p>System date: %s</p>\r\n", datestr);
    html(buf);
    System_sprintf(buf, "<p>System time: %s</p>\r\n", timestr);
    html(buf);
    html("</fieldset><br /><br />\r\n");

    emitFooter(htmlSock);

    return 1;
}

//*****************************************************************************
// CGI Config Page Callback Function
//*****************************************************************************

static Int sendConfigHtml(SOCKET htmlSock, int length)
{
    Char buf[MAX_RESPONSE_SIZE];

    /* Send header portion of the html */
    emitHeader(htmlSock, 1, "config");

    html("<div id=\"main\">\r\n");
    html("<form action=\"config.cgi\" method=\"post\">\r\n");

    /* GENERAL Settings */

    html("<fieldset>\r\n");
    html("<legend class=\"bold\">General Settings</legend>\r\n");
    System_sprintf(buf, "<input type=\"checkbox\" name=\"longtime\" value=\"yes\" %s> Wired remote displays time in timecode form<br />\r\n", g_sys.cfgSTC.showLongTime ? "checked" : "");
    html(buf);
    System_sprintf(buf, "<input type=\"checkbox\" name=\"blink\" value=\"yes\" %s> Blink transport 7-seg display during locate<br />\r\n", g_sys.cfgSTC.searchBlink ? "checked" : "");
    html(buf);
    html("</fieldset><br />\r\n");

    /* MIDI Settings */

    html("<fieldset>\r\n");
    html("<legend class=\"bold\">MIDI Settings</legend>\r\n");
    System_sprintf(buf, "Device ID:<br><input type=\"text\" name=\"devid\" value=\"%u\"> <br />\r\n", g_sys.cfgSTC.midiDevID);
    html(buf);
    html("</fieldset><br />\r\n");

    /* SMPTE Settings */

    html("<fieldset>\r\n");
    html("<legend class=\"bold\">SMPTE Settings</legend>\r\n");
    html("<label for=\"smpteRef\">Master ref clock frequency:</label><br>\r\n");
    System_sprintf(buf, "<input type=\"text\" name=\"refClock\" value=\"%u\"> <br />\r\n", (uint32_t)g_sys.cfgSTC.ref_freq);
    html(buf);
    html("<label for=\"frameRate\">Default frame rate:</label><br>\r\n");
    System_sprintf(buf, "<input type=\"text\" name=\"frameRate\" value=\"%s\"> <br />\r\n", getstrFPS());
    html(buf);
    html("</fieldset><br />\r\n");

    /* LOCATOR Settings */

