rtzaudio/STC1200_TivaTM4C1294NCPDT/httpServer.c
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Locator Settings</legend>\r\n");
    System_sprintf(buf, "Jog near velocity:<br><input type=\"text\" name=\"jognear\" value=\"%u\"><br />\r\n", g_sys.cfgSTC.jog_vel_near);
    html(buf);
    System_sprintf(buf, "Jog mid velocity:<br><input type=\"text\" name=\"jogmid\" value=\"%u\"><br />\r\n", g_sys.cfgSTC.jog_vel_mid);
    html(buf);
    System_sprintf(buf, "Jog far velocity:<br><input type=\"text\" name=\"jogfar\" value=\"%u\"><br />\r\n", g_sys.cfgSTC.jog_vel_far);
    html(buf);
    html("</fieldset><br />\r\n");

    /* TRANSPORT Settings */

    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Transport Settings</legend>\r\n");
    System_sprintf(buf, "Velocity detect threshold:<br><input type=\"text\" name=\"velDet\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.vel_detect_threshold);
    html(buf);
    System_sprintf(buf, "Record pulse strobe time:<br><input type=\"text\" name=\"strobeTime\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.record_pulse_time);
    html(buf);
    System_sprintf(buf, "Record hold settle time:<br><input type=\"text\" name=\"settleTime\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.rechold_settle_time);
    html(buf);
    System_sprintf(buf, "Transport button debounce time:<br><input type=\"text\" name=\"debounce\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.debounce);
    html(buf);
    html("</fieldset><br />\r\n");

    /* TENSION Settings */

    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Tension Settings</legend>\r\n");
    /* Supply */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Supply</legend>\r\n");
    System_sprintf(buf, "Stop:<br><input type=\"text\" name=\"stop_supply_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.stop_supply_tension);
    html(buf);
    System_sprintf(buf, "Shuttle:<br><input type=\"text\" name=\"shuttle_supply_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.shuttle_supply_tension);
    html(buf);
    System_sprintf(buf, "Play-LO:<br><input type=\"text\" name=\"play_lo_supply_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.play_lo_supply_tension);
    html(buf);
    System_sprintf(buf, "Play-HI:<br><input type=\"text\" name=\"play_hi_supply_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.play_hi_supply_tension);
    html(buf);
    System_sprintf(buf, "Thread:<br><input type=\"text\" name=\"thread_supply_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.thread_supply_tension);
    html(buf);
    html("</fieldset><br />\r\n");
    /* Takeup */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Takeup</legend>\r\n");
    System_sprintf(buf, "Stop:<br><input type=\"text\" name=\"stop_takeup_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.stop_takeup_tension);
    html(buf);
    System_sprintf(buf, "Shuttle:<br><input type=\"text\" name=\"shuttle_takeup_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.shuttle_takeup_tension);
    html(buf);
    System_sprintf(buf, "Play-LO:<br><input type=\"text\" name=\"play_lo_takeup_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.play_lo_takeup_tension);
    html(buf);
    System_sprintf(buf, "Play-HI:<br><input type=\"text\" name=\"play_hi_takeup_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.play_hi_takeup_tension);
    html(buf);
    System_sprintf(buf, "Thread:<br><input type=\"text\" name=\"thread_takeup_tension\" value=\"%u\"><br />\r\n", g_sys.cfgDTC.thread_takeup_tension);
    html(buf);
    html("</fieldset><br />\r\n");
    /* Tension Sensor */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Tension Sensor</legend>\r\n");
    System_sprintf(buf, "Tension sensor gain:<br><input type=\"text\" name=\"tension_sensor_gain\" value=\"%.1f\"><br />\r\n", g_sys.cfgDTC.tension_sensor_gain);
    html(buf);
    System_sprintf(buf, "ADC mid-scale offset 1\":<br><input type=\"text\" name=\"tension_sensor_midscale1\" value=\"%u\"><br />\r\n", (uint32_t)g_sys.cfgDTC.tension_sensor_midscale1);
    html(buf);
    System_sprintf(buf, "ADC mid-scale offset 2\":<br><input type=\"text\" name=\"tension_sensor_midscale2\" value=\"%u\"><br />\r\n", (uint32_t)g_sys.cfgDTC.tension_sensor_midscale2);
    html(buf);
    html("</fieldset><br />\r\n");
    /* Reeling Radius */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Reeling Radius</legend>\r\n");
    System_sprintf(buf, "Reeling radius gain:<br><input type=\"text\" name=\"reel_radius_gain\" value=\"%.1f\"><br />\r\n", g_sys.cfgDTC.reel_radius_gain);
    html(buf);
    System_sprintf(buf, "Reel offset gain:<br><input type=\"text\" name=\"reel_offset_gain\" value=\"%.1f\"><br />\r\n", g_sys.cfgDTC.reel_offset_gain);
    html(buf);
    html("</fieldset><br />\r\n");
    html("</fieldset><br />\r\n");

    /* STOP Mode */

    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Stop Mode</legend>\r\n");
    html("<label for \"stopTorque\">Dynamic stop brake torque:</label>\r\n");
    System_sprintf(buf, "<input type=\"text\" name=\"stopTorque\" value=\"%d\"> <br />\r\n",
                   g_sys.cfgDTC.stop_brake_torque);
    html(buf);
    System_sprintf(buf, "<input type=\"checkbox\" name=\"stopLifters\" value=\"yes\"> Leave lifters engaged at stop<br />\r\n",
                   getstrYesNo(g_sys.cfgDTC.sysflags & DTC_SF_LIFTER_AT_STOP));
    html(buf);
    System_sprintf(buf, "<input type=\"checkbox\" name=\"stopBrakes\" value=%s> Leave brakes engaged at stop<br />\r\n",
                   getstrYesNo(g_sys.cfgDTC.sysflags & DTC_SF_BRAKES_AT_STOP));
    html(buf);
    System_sprintf(buf, "<input type=\"checkbox\" name=\"stopEOT\" value=%s> Stop at end-of-tape sense<br />\r\n",
                   getstrYesNo(g_sys.cfgDTC.sysflags & DTC_SF_STOP_AT_TAPE_END));
    html(buf);
    html("</fieldset><br />\r\n");

    /* PLAY Mode */

#if 0
    /* Play Boost LO-Speed */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Play Boost LO-Speed</legend>\r\n");
    html("<label for \"playPgainLO\">P-Gain:</label><br>\r\n");
    System_printf(buf, "<input type=\"text\" name=\"playPgainLO\" value=\"%f\"> <br />\r\n", g_sys.cfgDTC.play_lo_boost_pgain);
    html(buf);
    html("<label for \"playIgainLO\">I-Gain:</label><br>\r\n");
    System_printf(buf, "<input type=\"text\" name=\"playIgainLO\" value=\"%f\"> <br />\r\n", g_sys.cfgDTC.play_lo_boost_igain);
    html(buf);
    html("<label for \"playDgainLO\">D-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"playDgainLO\" value=\"0\"> <br />\r\n");
    html("</fieldset><br />\r\n");

    /* Play Boost HI-Speed */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Play Boost HI-Speed</legend>\r\n");
    html("<label for \"playPgainHI\">P-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"playPgainHI\" value=\"0\"> <br />\r\n");
    html("<label for \"playIgainHI\">I-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"playIgainHI\" value=\"0\"> <br />\r\n");
    html("<label for \"playDgainHI\">D-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"playDgainHI\" value=\"0\"> <br />\r\n");
    html("</fieldset><br />\r\n");

