rtzaudio/STC1200_TivaTM4C1294NCPDT/httpServer.c
    /* Play Mode */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Play Mode</legend>\r\n");
    html("<label for \"settlePinch\">Pinch roller settle time after engage:</label><br>\r\n");
    html("<input type=\"text\" name=\"settlePinch\" value=\"0\"> <br />\r\n");
    html("<label for \"settlePlay\">Delay entering play after shuttle:</label><br>\r\n");
    html("<input type=\"text\" name=\"settlePlay\" value=\"0\"> <br />\r\n");
    html("<label for \"settleBrake\">Brake settle time after engage:</label><br>\r\n");
    html("<input type=\"text\" name=\"settleBrake\" value=\"0\"> <br />\r\n");
    html("<br />\r\n");
    html("<input type=\"checkbox\" name=\"brakesStopPlay\" value=\"yes\" > Use brakes to stop play mode<br />\r\n");
    html("<input type=\"checkbox\" name=\"pinchEngage\" value=\"yes\" > Engage pinch roller at play<br />\r\n");
    html("</fieldset><br />\r\n");

    /* Shuttle Mode */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Shuttle Mode</legend>\r\n");
    html("<label for \"settlePinch\">FWD shuttle back-tension gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \"settlePlay\">REW shuttle back-tension gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \"settleBrake\">Shuttle mode max velocity:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \"settleBrake\">Library wind mode velocity:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \"settleBrake\">Auto-Slow wind velocity:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \"settleBrake\">Auto-slow triggers at offset:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \">Auto-slow triggers at offset:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \">Auto-Slow min velocity to trigger:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("<label for \">Lifter settle time after engage:</label><br>\r\n");
    html("<input type=\"text\" name=\"\" value=\"0\"> <br />\r\n");
    html("</fieldset><br />\r\n");

    /* Shuttle Servo PID */
    html("<fieldset>\r\n");
    html("<legend class=\"bold\">Shuttle Servo PID</legend>\r\n");
    html("<label for \"shuttlePgain\">P-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"shuttlePgain\" value=\"0\"> <br />\r\n");
    html("<label for \"shuttleIgain\">I-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"shuttleIgain\" value=\"0\"> <br />\r\n");
    html("<label for \"shuttleDgain\">D-Gain:</label><br>\r\n");
    html("<input type=\"text\" name=\"shuttleDgain\" value=\"0\"> <br />\r\n");
    html("</fieldset><br />\r\n");
#endif

    /* End of form Save/Reset buttons */
    html("<input class=\"btn\" type=\"submit\" name=\"submit\" value=\"Save\">\r\n");
    html("<input class=\"btn\" type=\"reset\" name=\"submit\" value=\"Reset\">\r\n");
    html("</form>\r\n");

    emitFooter(htmlSock);

    return 1;
}

//*****************************************************************************
// CGI Handler Functions
//*****************************************************************************

// This function processes the CGI from off the config
// page on the HTTP server.
//
// CGI Functions must return 1 if the socket is left open,
// and zero if the socket is closed. This example always
// returns 1.
//
static int cgiConfig(SOCKET htmlSock, int ContentLength, char *pArgs )
{
    char    *buffer, *key, *value;
    int     len;
    int     parseIndex;
    int     val;

    // CGI Functions can now support URI arguments as well if the
    // pArgs pointer is not NULL, and the ContentLength were zero,
    // we could parse the arguments off of pArgs instead.

    // First, allocate a buffer for the request
    buffer = (char*) mmBulkAlloc( ContentLength );
    if ( !buffer )
        goto ERROR;

    // Now read the data from the client
    len = recv( htmlSock, buffer, ContentLength, MSG_WAITALL );
    if ( len < 1 )
        goto ERROR;

    // Setup to parse the post data
    parseIndex = 0;
    buffer[ContentLength] = '\0';

    g_sys.cfgSTC.showLongTime = false;
    g_sys.cfgSTC.searchBlink  = false;

    // Process request variables until there are none left
    do
    {
        key   = cgiParseVars(buffer, &parseIndex);
        value = cgiParseVars(buffer, &parseIndex);

        if (!strcmp("longtime", key))
            g_sys.cfgSTC.showLongTime = (strcmp(value, "yes") == 0) ? true : false;
        else if (!strcmp("blink", key))
            g_sys.cfgSTC.searchBlink = (strcmp(value, "yes") == 0) ? true : false;
        else if (!strcmp("jognear", key))
        {
            val = atoi(value);
            if ((val >= 0) && (val <= 300))
                g_sys.cfgSTC.jog_vel_near = (uint32_t)val;
        }
        else if (!strcmp("jogmid", key))
        {
            val = atoi(value);
            if ((val >= 0) && (val <= 500))
                g_sys.cfgSTC.jog_vel_mid = (uint32_t)val;
        }
        else if (!strcmp("jogfar", key))
        {
            val = atoi(value);
            if ((val >= 0) && (val <= 1100))
                g_sys.cfgSTC.jog_vel_far = (uint32_t)val;
        }
    } while(parseIndex != -1);

    // Output the data we read in...
    httpSendStatusLine(htmlSock, HTTP_OK, CONTENT_TYPE_HTML);
    // CRLF before entity
    html(CRLF);

    /* Write system parameters to EPROM */
    ConfigSave(1);

    // Send the updated page
    sendConfigHtml(htmlSock, 0);

ERROR:
    if (buffer)
        mmBulkFree(buffer);

    return 1;
}

//*****************************************************************************
// CGI Remote Page Callback Function
//*****************************************************************************

static void emitLocateButton(SOCKET htmlSock, int btn, bool state)
{
    Char buf[80];

    System_sprintf(buf, "<input class=\"btn%c\" type=\"submit\" name=\"loc%d\" value=\"LOC-%d\">\r\n",
                   state ? '1' : '0', btn, btn);
    html(buf);
}

static Int sendRemoteHtml(SOCKET htmlSock, int length)
{
    Char buf[MAX_RESPONSE_SIZE];

    emitHeader(htmlSock, -1, "remote");

