rtzaudio/STC1200_TivaTM4C1294NCPDT/httpServer.c
    html("<form action=\"remote.cgi\" method=\"post\">\r\n");
    html("<fieldset>\r\n");
    html("<legend>Transport</legend>\r\n");
    if (rec_arm)
    {
        System_sprintf(buf, "<input class=\"btnrec0\" type=\"submit\" name=\"rec\" value=\"REC\">\r\n");
    }
    else
    {
        if (rec_active) //g_sysData.ledMaskTransport & L_REC)
            System_sprintf(buf, "<input class=\"btnrec1\" type=\"submit\" name=\"rec\" value=\"REC\">\r\n");
        else
            System_sprintf(buf, "<input class=\"btn\" type=\"submit\" name=\"rec\" value=\"REC\">\r\n");
    }
    html(buf);
    html("<input class=\"btn\" type=\"submit\" name=\"play\" value=\"PLAY\">\r\n");
    html("<input class=\"btn\" type=\"submit\" name=\"rew\" value=\"REW\">\r\n");
    html("<input class=\"btn\" type=\"submit\" name=\"fwd\" value=\"FWD\">\r\n");
    html("<input class=\"btn\" type=\"submit\" name=\"stop\" value=\"STOP\">\r\n");
    html("</fieldset>\r\n");

    html("<fieldset>\r\n");
    html("<legend>Mode</legend>\r\n");
    System_sprintf(buf, "<input class=\"btn%c\" type=\"submit\" name=\"cue\" value=\"CUE\">\r\n", (g_sys.ledMaskRemote & L_CUE) ? '1' : '0');
    html(buf);
    System_sprintf(buf, "<input class=\"btn%c\" type=\"submit\" name=\"store\" value=\"STORE\">\r\n", (g_sys.ledMaskRemote & L_STORE) ? '1' : '0');
    html(buf);
    html("</fieldset>\r\n");

    html("<fieldset>\r\n");
    html("<legend>Locate</legend>\r\n");

    emitLocateButton(htmlSock, 1, (g_sys.ledMaskRemote & L_LOC1));
    emitLocateButton(htmlSock, 2, (g_sys.ledMaskRemote & L_LOC2));
    emitLocateButton(htmlSock, 3, (g_sys.ledMaskRemote & L_LOC3));
    emitLocateButton(htmlSock, 4, (g_sys.ledMaskRemote & L_LOC4));
    emitLocateButton(htmlSock, 5, (g_sys.ledMaskRemote & L_LOC5));
    emitLocateButton(htmlSock, 6, (g_sys.ledMaskRemote & L_LOC6));
    emitLocateButton(htmlSock, 7, (g_sys.ledMaskRemote & L_LOC7));
    emitLocateButton(htmlSock, 8, (g_sys.ledMaskRemote & L_LOC8));
    emitLocateButton(htmlSock, 9, (g_sys.ledMaskRemote & L_LOC9));
    emitLocateButton(htmlSock, 0, (g_sys.ledMaskRemote & L_LOC0));

    html("</fieldset>\r\n");
    html("</form>\r\n");
    //html("</div>\r\n");
    //html("</div>\r\n");
    html("</div>\r\n");
    html("</body>\r\n");
    html("</html>\r\n");

    return 1;
}

static int cgiRemote(SOCKET htmlSock, int ContentLength, char *pArgs )
{
    char    *buffer, *key, *value;
    int     len;
    int     parseIndex;
    //int     val;

    // CGI Functions can now support URI arguments as well if the
    // pArgs pointer is not NULL, and the ContentLength were zero,
    // we could parse the arguments off of pArgs instead.

    // First, allocate a buffer for the request
    buffer = (char*) mmBulkAlloc( ContentLength );
    if ( !buffer )
        goto ERROR;

    // Now read the data from the client
    len = recv( htmlSock, buffer, ContentLength, MSG_WAITALL );
    if ( len < 1 )
        goto ERROR;

    // Setup to parse the post data
    parseIndex = 0;
    buffer[ContentLength] = '\0';

    // Process request variables until there are none left
    do
    {
        key   = cgiParseVars(buffer, &parseIndex);
        value = cgiParseVars(buffer, &parseIndex);

        (void)value;

        /*** Transport Buttons ***/
        if (!strcmp("stop", key))
        {
            Transport_PostButtonPress(S_STOP);
            rec_arm = rec_active = false;
        }
        else if (!strcmp("play", key))
        {
            if (rec_arm)
            {
                Transport_PostButtonPress(S_PLAY|S_REC);
                rec_active = true;
                rec_arm = false;
            }
            else
            {
                Transport_Play(0);
                rec_arm = rec_active = false;
            }
        }
        else if (!strcmp("rew", key))
        {
            Transport_PostButtonPress(S_REW);
            rec_arm = rec_active = false;
        }
        else if (!strcmp("fwd", key))
        {
            Transport_PostButtonPress(S_FWD);
            rec_arm = rec_active = false;
        }
        else if (!strcmp("rec", key))
        {
            if (rec_arm)
                rec_arm = false;
            else
                rec_arm = true;
        }
        else
        {
            rec_arm = rec_active = false;

            /*** Mode Buttons ***/
            if (!strcmp("cue", key))
            {
                Remote_PostSwitchPress(SW_CUE, 0);
            }
            else if (!strcmp("store", key))
            {
                Remote_PostSwitchPress(SW_STORE, 0);
            }
            /*** Locate Buttons ***/
            if (!strcmp("loc1", key))
            {
                Remote_PostSwitchPress(SW_LOC1, 0);
            }
            else if (!strcmp("loc2", key))
            {
                Remote_PostSwitchPress(SW_LOC2, 0);
            }
            else if (!strcmp("loc3", key))
            {
                Remote_PostSwitchPress(SW_LOC3, 0);
            }
            else if (!strcmp("loc4", key))
            {
                Remote_PostSwitchPress(SW_LOC4, 0);
            }
            else if (!strcmp("loc5", key))
            {
                Remote_PostSwitchPress(SW_LOC5, 0);
            }
            else if (!strcmp("loc6", key))
            {
                Remote_PostSwitchPress(SW_LOC6, 0);
            }
            else if (!strcmp("loc7", key))
            {
                Remote_PostSwitchPress(SW_LOC7, 0);
            }
            else if (!strcmp("loc8", key))
            {
                Remote_PostSwitchPress(SW_LOC8, 0);
            }
            else if (!strcmp("loc9", key))
            {
                Remote_PostSwitchPress(SW_LOC9, 0);
            }
            else if (!strcmp("loc0", key))
            {
                Remote_PostSwitchPress(SW_LOC0, 0);
            }
        }
    } while(parseIndex != -1);

    // Output the data we read in...
    httpSendStatusLine(htmlSock, HTTP_OK, CONTENT_TYPE_HTML);
    // CRLF before entity
    html(CRLF);

    // Send the updated page
    sendRemoteHtml(htmlSock, 0);

ERROR:
    if (buffer)
        mmBulkFree(buffer);

    return 1;
}

/* End-Of-File */
